/****************************************************************************

    Файл checkers.h

    Заголовочный файл модуля checkers.c

    Маткин Илья Александрович       22.06.2010

****************************************************************************/

#ifndef _CHECKERS_H_
#define _CHECKERS_H_

#include <windows.h>

//----------------------------------------

//--------------------

//----------------------------------------

/*
Функция создания шашки.

Аргументы:
ins     описатель приложения
parent  описатель родительского окна для шашки
color   цвет шашки
x       Х-координата центра шашки
y       У-координата центра шашки

Возвращаемое значение:
описатель созданного окна шашки

//*/

HWND CreateCheckerWindow(HINSTANCE ins,HWND parent,COLORREF color,unsigned int x,unsigned int y);

//----------------------------------------

#endif  // _CHECKERS_H_
